spec/fixtures/subscriptions.json

[
  {
    "subscription": {
      "id": 15236915,
      "state": "active",
      "balance_in_cents": 0,
      "total_revenue_in_cents": 14000,
      "product_price_in_cents": 1000,
      "product_version_number": 7,
      "current_period_ends_at": "2016-11-15T14:48:10-05:00",
      "next_assessment_at": "2016-11-15T14:48:10-05:00",
      "trial_started_at": null,
      "trial_ended_at": null,
      "activated_at": "2016-11-14T14:48:12-05:00",
      "expires_at": null,
      "created_at": "2016-11-14T14:48:10-05:00",
      "updated_at": "2016-11-14T15:24:41-05:00",
      "cancellation_message": null,
      "cancellation_method": null,
      "cancel_at_end_of_period": null,
      "canceled_at": null,
      "current_period_started_at": "2016-11-14T14:48:10-05:00",
      "previous_state": "active",
      "signup_payment_id": 162269766,
      "signup_revenue": "260.00",
      "delayed_cancel_at": null,
      "coupon_code": "5SNN6HFK3GBH",
      "payment_collection_method": "automatic",
      "snap_day": null,
      "customer": {
        "first_name": "Curtis",
        "last_name": "Test",
        "email": "curtis@example.com",
        "cc_emails": null,
        "organization": "",
        "reference": null,
        "id": 14714298,
        "created_at": "2016-11-14T14:48:10-05:00",
        "updated_at": "2016-11-14T14:48:13-05:00",
        "address": "123 Anywhere Street",
        "address_2": "",
        "city": "Boulder",
        "state": "CO",
        "zip": "80302",
        "country": "US",
        "phone": "",
        "verified": false,
        "portal_customer_created_at": "2016-11-14T14:48:13-05:00",
        "portal_invite_last_sent_at": "2016-11-14T14:48:13-05:00",
        "portal_invite_last_accepted_at": null
      },
      "product": {
        "id": 3792003,
        "name": "$10 Basic Plan",
        "handle": "basic",
        "description": "lorem ipsum",
        "accounting_code": "basic",
        "price_in_cents": 1000,
        "interval": 1,
        "interval_unit": "day",
        "initial_charge_in_cents": null,
        "expiration_interval": null,
        "expiration_interval_unit": "never",
        "trial_price_in_cents": null,
        "trial_interval": null,
        "trial_interval_unit": "month",
        "initial_charge_after_trial": false,
        "return_params": "",
        "request_credit_card": false,
        "require_credit_card": false,
        "created_at": "2016-03-24T13:38:39-04:00",
        "updated_at": "2016-11-03T13:03:05-04:00",
        "archived_at": null,
        "update_return_url": "",
        "update_return_params": "",
        "product_family": {
          "id": 527890,
          "name": "Acme Projects",
          "handle": "billing-plans",
          "accounting_code": null,
          "description": ""
        },
        "public_signup_pages": [
          {
            "id": 281054,
            "url": "https://general-goods.chargify.com/subscribe/kqvmfrbgd89q/basic"
          },
          {
            "id": 281240,
            "url": "https://general-goods.chargify.com/subscribe/dkffht5dxfd8/basic"
          },
          {
            "id": 282694,
            "url": "https://general-goods.chargify.com/subscribe/jwffwgdd95s8/basic"
          }
        ],
        "taxable": false,
        "version_number": 7
      },
      "credit_card": {
        "id": 10191713,
        "payment_type": "credit_card",
        "first_name": "Curtis",
        "last_name": "Test",
        "masked_card_number": "XXXX-XXXX-XXXX-1",
        "card_type": "bogus",
        "expiration_month": 1,
        "expiration_year": 2026,
        "billing_address": "123 Anywhere Street",
        "billing_address_2": "",
        "billing_city": "Boulder",
        "billing_state": null,
        "billing_country": "",
        "billing_zip": "80302",
        "current_vault": "bogus",
        "vault_token": "1",
        "customer_vault_token": null,
        "customer_id": 14714298
      },
      "payment_type": "credit_card",
      "referral_code": "w7",
      "id": null,
      "coupon_use_count": 1,
      "coupon_uses_allowed": 1
    }
  },
  {
    "subscription": {
      "id": 15189649,
      "state": "canceled",
      "balance_in_cents": 15000,
      "total_revenue_in_cents": 10000,
      "product_price_in_cents": 10000,
      "product_version_number": 1,
      "current_period_ends_at": "2017-11-10T13:14:00-05:00",
      "next_assessment_at": "2017-11-10T13:14:00-05:00",
      "trial_started_at": null,
      "trial_ended_at": null,
      "activated_at": "2016-11-10T13:14:02-05:00",
      "expires_at": null,
      "created_at": "2016-11-10T13:14:00-05:00",
      "updated_at": "2016-11-14T11:14:01-05:00",
      "cancellation_message": "",
      "cancellation_method": "merchant_ui",
      "cancel_at_end_of_period": false,
      "canceled_at": "2016-11-14T11:14:01-05:00",
      "current_period_started_at": "2016-11-10T13:14:00-05:00",
      "previous_state": "canceled",
      "signup_payment_id": 161794022,
      "signup_revenue": "100.00",
      "delayed_cancel_at": null,
      "coupon_code": null,
      "payment_collection_method": "invoice",
      "snap_day": null,
      "customer": {
        "first_name": "Frankie",
        "last_name": "Bravo",
        "email": "testfrankietest.com",
        "cc_emails": "",
        "organization": "",
        "reference": null,
        "id": 14543712,
        "created_at": "2016-11-02T10:16:17-04:00",
        "updated_at": "2016-11-14T09:54:39-05:00",
        "address": "",
        "address_2": "",
        "city": "",
        "state": "",
        "zip": "",
        "country": "",
        "phone": "5555551212",
        "verified": true,
        "portal_customer_created_at": "2016-11-02T10:16:19-04:00",
        "portal_invite_last_sent_at": "2016-11-10T13:14:03-05:00",
        "portal_invite_last_accepted_at": null
      },
      "product": {
        "id": 4038269,
        "name": "Annual Product",
        "handle": "annual-product",
        "description": "",
        "accounting_code": "",
        "price_in_cents": 10000,
        "interval": 12,
        "interval_unit": "month",
        "initial_charge_in_cents": null,
        "expiration_interval": null,
        "expiration_interval_unit": "never",
        "trial_price_in_cents": null,
        "trial_interval": null,
        "trial_interval_unit": "month",
        "initial_charge_after_trial": false,
        "return_params": "",
        "request_credit_card": true,
        "require_credit_card": true,
        "created_at": "2016-09-28T09:54:05-04:00",
        "updated_at": "2016-09-28T09:54:05-04:00",
        "archived_at": null,
        "update_return_url": "",
        "update_return_params": "",
        "product_family": {
          "id": 527890,
          "name": "Acme Projects",
          "handle": "billing-plans",
          "accounting_code": null,
          "description": ""
        },
        "public_signup_pages": [
          {
            "id": 297032,
            "url": "https://general-goods.chargify.com/subscribe/b3hjynp5ss52/annual-product"
          }
        ],
        "taxable": false,
        "version_number": 1
      },
      "credit_card": {
        "id": 10188522,
        "payment_type": "credit_card",
        "first_name": "Frank",
        "last_name": "Test",
        "masked_card_number": null,
        "card_type": null,
        "expiration_month": null,
        "expiration_year": null,
        "billing_address": "123 Montana Way",
        "billing_address_2": "",
        "billing_city": "Boulder",
        "billing_state": "CO",
        "billing_country": "US",
        "billing_zip": "80302",
        "current_vault": "bogus",
        "vault_token": "123456789",
        "customer_vault_token": null,
        "customer_id": 14543712
      },
      "payment_type": "bank_account",
      "referral_code": "hspss6",
      "next_product_id": null,
      "coupon_use_count": null,
      "coupon_uses_allowed": null
    }
  }
]
